Revit 2024 API
AdaptiveComponentInstanceUtils Members
The AdaptiveComponentInstanceUtils type exposes the following members.
Methods
Name | Description
CreateAdaptiveComponentInstance
 Creates a FamilyInstance of Adaptive Component Family.
GetInstancePlacementPointElementRefIds
 Gets Placement Adaptive Point Element Ref ids to which the instance geometry adapts.
GetInstancePointElementRefIds
 Gets Adaptive Point Element Ref ids to which the instance geometry adapts.
GetInstanceShapeHandlePointElementRefIds
 Gets Shape Handle Adaptive Point Element Ref ids to which the instance geometry adapts.
HasAdaptiveFamilySymbol
 Verifies if a FamilyInstance has an Adaptive Family Symbol.
IsAdaptiveComponentInstance
 Verifies if a FamilyInstance is an Adaptive Component Instance.
IsAdaptiveFamilySymbol
 Verifies if a FamilySymbol is a valid Adaptive Family Symbol.
IsInstanceFlipped
 Gets the value of the flip parameter on the adaptive instance.
MoveAdaptiveComponentInstance
 Moves Adaptive Component Instance by the specified transformation.
SetInstanceFlipped
 Sets the value of the flip parameter on the adaptive instance.
See Also
AdaptiveComponentInstanceUtils Class
Autodesk.Revit.DB Namespace